
//@author pro100user

import java.util.Scanner;

public class Main {

    public static void main(String[] args) {

    }


    /*
    * 23. а) міняє місцями першу і останню літери кожного слова;
    * б) видаляє всі слова, що починаються з малої літери.
    * */
    public static void task1(){
        Scanner scanner = new Scanner(System.in);
        String str = scanner.nextLine();

        int i = 0;
        for (int i1=0;str.isEmpty();i1++) {
            if(str[i1] != ' ')
        }
    }


    /*
    * 23. Створіть файл, який містить середній бал успішності студентів вашої групи
    * (кількість студентів групи та їхні середні бали вводяться з клавіатури).
    * Підрахуйте загальний середній бал групи.
    * */
    public static void task2(){

    }


    /*
    * Розв’язати задачу з індивідуального завдання 1(б) при умові, що текстовий рядок імпортується
    * з деякого наперед створеного файла input.txt, а результати роботи програми потрібно записати
    * у новостворений під час виконання проекту файл output.txt.
    * 3. а) підраховує кількість слів у тексті, які закінчуються на голосну літеру; б) виводить на екран
    * */
    public static void task3(){

    }
}
